Repository: 84000/data-translation-memory
Catalog: toh557-v3.tmx
Source language: bo
Languages: en

source: ཇི་ལྟར་ལྷའི་ཁང་ཁྱིམ་ཐམས་ཅད་ལྷ་དག་དང་ལྷའི་བུ་རྣམས་ཀྱིས་གང་བར་འགྱུར་བ་དང་། ཇི་ལྟར་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དཔུང་དང་གཡོག་ཏུ་བཅས་པ་དང་། གནོད་སྦྱིན་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། འཛམ་བུའི་གླིང་ན་གནས་པའི་ལྷའི་ཚོགས་ཐམས་ཅད་ཚིམ་པ་དང་རིམ་གྲོ་བགྱིད་པར་འགྱུར་བ་དང་། ཇི་ལྟར་བདག་ཅག་གི་ལྷའི་ལུས་འདི་དག་གཟི་བརྗིད་ཆེན་པོ་རྣམ་པར་འཕེལ་བར་འགྱུར་བ་དང་། ཇི་ལྟར་བདག་ཅག་གི་ལུས་ལ་བརྩོན་འགྲུས་དང་སྟོབས་དང་མཐུ་ཆེན་པོ་བསྐྱེད་པར་འགྱུར་བ་དང་། ཇི་ལྟར་བདག་ཅག་གི་ལུས་ལ་གཟི་བརྗིད་དང་དཔལ་དང་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཇུག་པར་འགྱུར་བ་དང་། ཇི་ལྟར་འཛམ་བུའི་གླིང་ཐམས་ཅད་ལོ་ལེགས་ཤིང་ཉམས་དགའ་བ་དང་སྐྱེ་བོ་དང་མིས་གང་བར་འགྱུར་བ་དང་། ཇི་ལྟར་འཛམ་བུའི་གླིང་ཐམས་ཅད་ན་གནས་པའི་སེམས་ཅན་རྣམས་བདེ་བར་འགྱུར་བ་དང་། དགའ་བ་སྣ་ཚོགས་མྱོང་བར་འགྱུར་བ་དང་། ཇི་ལྟར་སེམས་ཅན་ཐམས་ཅད་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མར་ལྷ་དང་མིའི་བདེ་བ་རྒྱ་ཆེ་ཞིང་རྒྱ་ཆེ་བ་མྱོང་བར་འགྱུར་བ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་ལྷན་ཅིག་གནས་པར་འགྱུར་བ་དང་། མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་དེ་ལྟ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཚངས་པའི་དབང་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་པས་ཆེས་འཕགས་པའི་ཐུགས་རྗེ་ཆེན་པོའི་སྟོབས་དང་ལྡན་པའི་བྱིན་གྱི་རླབས་དང་བརྒྱ་བྱིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་གི་ལྷའི་ཤེས་པ་བས་ཆེས་འཕགས་པ། དེ་བཞིན་གཤེགས་པའི་མཁྱེན་པ་བླ་ན་མེད་པ་དང་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་ཅན་རྣམ་པ་སྣ་ཚོགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ཐམས་ཅད་པས་ཆེས་འཕགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་སླད་དུ།
en: The bhagavat arhat samyaksaṃbuddha teaches this Lord King of Sūtras, the Sublime Golden Light extensively in this Jambudvīpa for the sake of all beings so that the kings of humans who dwell throughout Jambudvīpa will have sovereignty; so that all beings will become happy; so that all domains will be guarded and defended; so that there will be no harm or enemies in all dominions; so that the armies of adversaries will be defeated and will retreat; so that there will be no disease or disturbances; so that human kings will light the great lamp of the Dharma and illuminate their own domains; so that the mansions of the devas will be filled with devas and their children; so that we, the Four Mahārājas, and our armies, attendants, and many hundreds of thousands of yakṣas, and all the hosts of devas that dwell in Jambudvīpa, will be satiated and worshiped; so that our divine bodies will increase in great magnificence; so that diligence, might, and great strength develop in our bodies; so that there will be good harvests; so that there will be happiness throughout all Jambudvīpa, which will become filled with beings and people; so that all beings who dwell in Jambudvīpa will be happy, experiencing various kinds of happiness; so that all beings will experience the vast, vast happiness of devas and humans for many hundreds of thousands of quintillions of eons; and so that they will be in the company of buddha bhagavats and in a future time will all attain the highest, most complete enlightenment.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཛམ་བུའི་གླིང་འདིར་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བཤད་དོ། །མིའི་རྒྱལ་པོའི་དགོངས་པ་དང་རྒྱལ་པོའི་བསྟན་བཅོས་དང་རྒྱལ་པོའི་བགྱི་བ་གང་དག་འཛམ་བུའི་གླིང་ཐམས་ཅད་ན་མཆིས་པ་དང་། གང་དག་གིས་སེམས་ཅན་འདི་དག་ཐམས་ཅད་བདེ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོ་འདི་ཉེ་བར་བསྟན། ཡོངས་སུ་བརྗོད། ཡང་དག་པར་རབ་ཏུ་བཤད་དོ། །
en: “Whatever worldly or nonworldly kingly duties, treatises on kingship, or kingly deeds throughout Jambudvīpa bring happiness to all beings, they are all taught, described, and explained by the bhagavat arhat tathāgata samyaksaṃbuddha in thisLord King of Sūtras, the Sublime Golden Light.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་རྒྱུ་དེ་དང་རྐྱེན་དེས་མིའི་རྒྱལ་པོ་དེས་གདོན་མི་འཚལ་བར་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་གུས་པར་མཉན་པར་བགྱི། གུས་པར་རིམ་གྲོར་བགྱི།
en: “Venerable Bhagavat, because of that cause and condition, a human king should reverently listen with conviction to this Lord King of Sūtras, the Sublime Golden Light, reverently worship it, and reverently make offerings to it.”

source: གུས་པར་མཆོད་པར་བགྱིའོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དེའི་ཕྱིར་རྒྱལ་པོ་ཆེན་པོ་ཁྱེད་བཞི་དཔུང་དང་གཡོག་ཏུ་བཅས་པས་གདོན་མི་ཟ་བར་མིའི་རྒྱལ་པོ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉན་པ་དང་རིམ་གྲོ་བྱེད་པ་དང་མཆོད་པ་བྱེད་པ་དེ་དག་ཀུན་ཏུ་བསྲུང་བའི་ཕྱིར་སྤྲོ་བ་ཆེར་གྱིས་ཤིག །རྒྱལ་པོ་ཆེན་པོ་དག །
en: When the Four Mahārājas had said that, the Bhagavat said to them, “Therefore, you Four Mahārājas, with your army and attendants, should with great enthusiasm guard the kings who with conviction listen to, worship, and make offerings to this Lord King of Sūtras, the Sublime Golden Light.

source: དགེ་སློང་ངམ། དགེ་སློང་མ་འམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་མདོ་སྡེའི་དབང་པོ་རྒྱལ་པོ་འཛིན་པ་དེ་དག་ཀྱང་།
en: “Mahārājas, you should cause the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess this lord king of sūtras to possess buddha activity.

source: སངས་རྒྱས་ཀྱི་མཛད་པ་འཛིན་དུ་ཆུ་གཅིག་དང་། དེ་དག་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་འདི་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པར་འགྱུར།
en: They will perform buddha activity in this world with its devas, humans, and asuras.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་འཆད་པར་འགྱུར་ཏེ།
en: They will extensively and correctly teach this Lord King of Sūtras, the Sublime Golden Light.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱེད་བཞིས་ཅི་ནས་མདོ་སྡེའི་དབང་པོ་འཛིན་པའི་དགེ་སློང་དང་དགེ་སློང་མ་དང་དགེ་བསྙེན་དང་དགེ་བསྙེན་མ་བསྲུང་བ་དང་། གནོད་པ་མེད་པ་དང་། ནད་མེད་པ་དང་། འཁྲུག་པ་མེད་པ་དང་། སེམས་བདེ་བར་འགྱུར་ཞིང་།
en: “You, the Four Mahārājas, should ensure that the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess this lord of sūtras are guarded, are unharmed, have no illness, have no disturbances, and are happy.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་འགྱུར་བར་དགེ་སློང་ངམ་དགེ་སློང་མ་འམ་དགེ་བསྙེན་ནམ་དགེ་བསྙེན་མ་མདོ་སྡེའི་དབང་པོ་འཛིན་པ་དེ་དག་ཀུན་ཏུ་བསྲུང་བར་བྱ། ཡོངས་སུ་བསྐྱབ་པར་བྱ། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བར་བྱའོ། །
en: “Guard, defend, take in your care, protect, and bring peace and well-being to the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who will teach this Lord King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་དང་། རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་དང་། རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་དང་། རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། དེའི་ཚེ་མངོན་སུམ་དུ་ཚུལ་དང་མཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་དོ། །རྒྱལ་བ་ཟླ་བ་དྲི་མ་མེད་པའི་སྐུ། །
en: Then Mahārāja Vaiśravaṇa, Mahārāja Dhṛtarāṣṭra, Mahārāja Virūḍhaka, and Mahārāja Virūpākṣa rose from their seats, and with their upper robes over one shoulder, knelt on their right knee, and with palms together in homage, bowed toward the Bhagavat.

source: རྒྱལ་བ་ཉི་མ་འོད་ཟེར་སྟོང་གི་འོད། །རྒྱལ་བ་པདྨ་དྲི་མ་མེད་པའི་སྤྱན། །རྒྱལ་བ་མེ་ཏོག་པད་རྩ་རྡུལ་མེད་ཚེམས། །རྒྱལ་བའི་ཡོན་ཏན་རྒྱ་མཚོ་ལྟ་བུ་སྟེ། །རིན་པོ་ཆེ་ནི་དུ་མའི་འབྱུང་གནས་གྱུར། །རྒྱལ་བ་རྒྱ་མཚོ་ཡེ་ཤེས་ཆུ་ཡིས་གང་། །ཏིང་འཛིན་བརྒྱ་ཕྲག་སྟོང་གིས་ཀུན་ཏུ་གང་། །རྒྱལ་བའི་ཞབས་ནི་འཁོར་ལོར་བྲིས་པ་སྟེ། །ཁོར་ཡུག་མུ་ཁྱུད་དེ་བཞིན་རྩིབ་མ་སྟོང་། །ཕྱག་དང་ཞབས་ནི་དྲ་བས་སྤྲས་པ་སྟེ། །ཞབས་ཀྱི་དྲ་བ་ངང་པའི་དབང་པོ་བཞིན། །གསེར་གྱི་རི་བོ་ལྟ་བུར་རབ་ཏུ་གདའ། །རྒྱལ་བ་དྲི་མེད་གསེར་གྱི་རི་དབང་པོ། །ཡོན་ཏན་ཐམས་ཅད་རི་རབ་འདྲ་བ་སྟེ། །
en: At that time, they directly praised the Bhagavat with these appropriate verses: “To the stainless moon of the Jina’s body, To the light of the thousand rays of the Jina’s sun, To the stainless lotuses of the Jina’s eyes, And to the spotless lotus roots of the Jina’s teeth; “To the sea of the Jina’s qualities That is the source of many jewels; To the Jina’s ocean filled with the water of wisdom That is pervaded by hundreds of thousands of samādhis; “To the Jina’s feet with the design of wheels, With hubs, rims, and a thousand spokes; To the hands and feet beautified by webs, The webs of the feet like those of the lord of geese; “And to the mountain of the Jina that is stainless gold And that is shining like a golden mountain, Who, like Meru, possesses all qualities— To the Jina, the lord of mountains, we pay homage.

source: སངས་རྒྱས་རི་དབང་རྒྱལ་ལ་ཕྱག་འཚལ་ལོ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བ་ཉ་བ་འདྲ། །ནམ་མཁའ་དང་ཡང་མཚུངས་ཤིང་འདྲ་བ་སྟེ། །སྒྱུ་མ་སྨིག་རྒྱུ་ལྟ་བུ་ཆགས་མེད་པ། །རྒྱལ་བ་དྲི་མ་མེད་ལ་ཕྱག་འཚལ་ལོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། སྟོབས་བཅུ་དག་གི་གསེར་འོད་དམ་པ་ཡི། །མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་རབ་མཆོག་འདི། །
en: “To the Tathāgata who is like the sun and moon, To the one who is similar to and equal to space, Who has no impediment like a mirage or illusion, To the stainless Jina we pay homage.”

source: འཇིག་རྟེན་སྐྱོང་བ་ཁྱེད་ཅག་རྣམས་ཀྱིས་ནི། །བརྩོན་འགྲུས་རབ་ཏུ་བརྟན་པས་བསྐྱང་བར་བྱ། །འདི་ལྟར་མདོ་སྡེ་དཀོན་མཆོག་ཟབ་མོ་འདི། །སེམས་ཅན་ཀུན་ལ་བདེ་བ་སྦྱིན་བྱེད་པ། །སེམས་ཅན་རྣམས་ལ་ཕན་དང་བདེ་བའི་ཕྱིར། །
en: The Bhagavat then spoke these verses to the Four Mahārājas: “You who are guardians of the world Should protect with unwavering diligence The Golden Light, the Supreme King andLord of Sūtras of those with the ten strengths, “So that this profound, precious sūtra That bestows happiness on all beings Will remain long in this Jambudvīpa For the sake of the happiness and benefit of beings.

source: འཛམ་བུའི་གླིང་འདིར་ཡུན་རིང་གནས་པར་འགྱུར། །འདི་ལྟར་སྟོང་གསུམ་གྱི་ནི་སྟོང་ཆེན་གྱི། །འཇིག་རྟེན་དག་ན་ངན་སོང་སྡུག་བསྔལ་དང་། །སེམས་ཅན་དམྱལ་བའི་སེམས་ཅན་རྣམས་ཀྱི་ནི། །སྡུག་བསྔལ་ཐམས་ཅད་ཞི་བར་བྱེད་པའོ། །
en: “It will bring an end to all the suffering Of the beings that are in the hells And the suffering of the lower existences In the worlds of this trichiliocosm.

source: གང་དག་འཛམ་བུའི་གླིང་ནི་འདི་ན་ཡང་། །འཛམ་བུའི་གླིང་གནས་རྒྱལ་པོ་ཐམས་ཅད་ཀྱིས། །རབ་ཏུ་དགའ་བ་ཆེན་པོ་བསྐྱེད་ནས་ནི། །ཆོས་རྣམས་ཀྱིས་ནི་ཡུལ་དག་བསྐྱང་བར་གྱིས། །
en: “Within this Jambudvīpa, May all the kings in Jambudvīpa With great, perfect joy Protect their domains through the Dharma.

source: གང་གིས་འཛམ་བུའི་གླིང་འདི་བདེ་བ་དང་། །ཤིན་ཏུ་ལོ་ལེགས་ཉམས་ཀྱང་དགར་འགྱུར་ཞིང་། །འཛམ་བུའི་གླིང་ནི་ཐམས་ཅད་དག་ན་ཡང་། །སེམས་ཅན་ཐམས་ཅད་བདེ་བར་འགྱུར་བར་གྱིས། །
en: “May those who make Jambudvīpa happy With excellent harvests and joy Make all beings become happy Throughout the whole of Jambudvīpa.

source: འདི་ནི་མི་ཡི་དབང་པོ་གང་རྣམས་ནི། །ཡུལ་ན་དགའ་དང་བདག་བདེ་དགའ་བ་དང་། །རྒྱལ་སྲིད་རྣམ་པར་འབྱོར་པ་དགའ་བ་དེས། །མདོ་སྡེའི་དབང་པོ་འདི་ནི་མཉན་པར་བྱ། །
en: “Those who are lords of humans here, Who delight in their domain and who are happy and joyful, Who delight in the wealth of sovereignty, Should listen to this lord of the sūtras.

source: ཕ་རོལ་དགྲ་ནི་ཡང་དག་ཟད་བྱེད་པ། །ཕ་རོལ་དགྲ་ཚོགས་ཟློག་པ་དགེ་བྱེད་པ། །
en: “The opposing hordes of enemies will come to an end; This source of goodness will repel enemy armies.

source: མཆོག་ཏུ་འཇིགས་པས་ཕོངས་པ་སེལ་བྱེད་པ། །
en: Ruination through the greatest fear will be averted.

source: མཆོག་ཏུ་དགེ་བྱེད་མདོ་སྡེའི་དབང་པོ་འདིའོ། །
en: This lord of sūtras is the source of goodness.

source: ཇི་ལྟར་རིན་ཆེན་ཤིང་ལྗོན་རབ་མཛེས་པ། །ཡོན་ཏན་ཀུན་འབྱུང་ཁྱིམ་ན་ཡོད་པ་ལྟར། །རྒྱལ་པོ་ཡོན་ཏན་འདོད་པ་རྣམས་ཀྱིས་ཀྱང་། །མདོ་སྡེའི་དབང་པོའི་མཆོག་འདི་དེ་ལྟར་བལྟ། །
en: “A king who wishes for good qualities Should view this supreme lord of sūtras As being like a beautiful, precious tree That is in the home, and the source of all qualities.

source: ཇི་ལྟར་ཆུ་གྲང་སྐོམ་པ་སེལ་བྱེད་པ། །ཚ་བས་ཉམ་ཐག་ཆེ་ན་རྙེད་པ་ལྟར། །ཡོན་ཏན་དག་གིས་སྐོམ་པའི་རྒྱལ་པོ་ལ། །མདོ་སྡེའི་རྒྱལ་པོའི་མཆོག་འདི་དེ་བཞིན་ནོ། །
en: “Just as cool water dispels thirst When found by someone fatigued by heat, That is what this supreme king of sūtras is like For a king who is thirsty for good qualities.

source: ཇི་ལྟར་རིན་ཆེན་ཐམས་ཅད་འབྱུང་བའི་གནས། །རིན་ཆེན་སྣོད་ནི་ལག་མཐིལ་ཡོད་པ་ལྟར། །མི་ཡི་དབང་པོའི་ཚོགས་ལ་གསེར་འོད་མཆོག །མདོ་སྡེའི་དབང་པོའི་མཆོག་འདི་དེ་བཞིན་ནོ། །
en: “Like a precious casket in the hands, Which is a source of every jewel, That is what this supreme king of sūtras, The Golden Light, is for the multitudes of kings.

source: འདི་ནི་ལྷ་ཡི་ཚོགས་ཀྱིས་མངོན་མཆོད་པ། །
en: “The devas make offerings to this lord of sūtras.

source: མདོ་སྡེའི་དབང་པོ་ལྷ་དབང་ཕྱག་བྱས་པ། །
en: The lords of the devas pay homage to it.

source: འཇིག་རྟེན་སྐྱོང་བ་རྫུ་འཕྲུལ་ཆེན་པོ་ལ། །བཞི་པོ་དག་གིས་ཀུན་ཏུ་བསྲུངས་པ་ཡིན། །
en: The four protectors of the world, With great miracles, guard it well.

source: ཕྱོགས་བཅུ་དག་ན་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་། །མདོ་སྡེའི་དབང་པོ་འདི་ནི་རྟག་ཏུ་དགོངས། །
en: “The buddhas in the ten directions Always think of this lord of sūtras.

source: མདོ་སྡེའི་དབང་པོ་འདི་ནི་བཤད་པ་ན། །སངས་རྒྱས་རྣམས་ཀྱིས་ལེགས་ཞེས་བརྗོད་པ་བྱིན། །
en: Whenever this sūtra is taught, The buddhas express their approval.

source: གནོད་སྦྱིན་བྱེ་བ་སྟོང་ཕྲག་བརྒྱ་རྣམས་ཀྱིས། །ཕྱོགས་བཅུ་དག་ཏུ་ཡུལ་ཡང་སྲུང་བར་བྱེད། །རབ་ཏུ་དགའ་ཞིང་རབ་ཏུ་མགུ་སེམས་ཀྱིས། །མདོ་སྡེའི་དབང་པོ་འདི་ནི་ཉན་པར་བྱེད། །
en: “The million million yakṣas that guard The domains in the ten directions Listen to this lord of sūtras With joyful minds and with delight.

source: འཛམ་བུའི་གླིང་ན་གནས་པར་གྱུར་པ་ཡི། །ལྷ་ཡི་ཚོགས་རྣམས་བསམ་གྱིས་མི་ཁྱབ་པ། །
en: “The hosts of devas that dwell In Jambudvīpa are beyond number.

source: ལྷ་ཚོགས་དེ་དག་ཀུན་ཀྱང་རབ་དགའ་བས། །མདོ་སྡེའི་དབང་པོ་འདི་ནི་ཉན་པར་བྱེད། །
en: Those hosts of devas, with complete joy, Listen to this lord of sūtras.

source: ཆོས་རྣམས་མཉན་པར་བྱ་བ་འདི་ཡིས་ནི། །གཟི་བརྗིད་དང་ནི་སྟོབས་དང་བརྩོན་འགྲུས་ཐོབ། །གཟི་བརྗིད་ཆེན་པོ་ཡི་ནི་ལྷ་ཡི་ལུས། །ཤིན་ཏུ་རྒྱས་ཤིང་རྣམ་པར་འཕེལ་བར་འགྱུར། །
en: “Through the act of listening to this sūtra, They gain magnificence, strength, and diligence, And the magnificence of their divine bodies Vastly increases and expands.”

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་ལྟ་བུ་འདི་དག་ཐོས་པ་དང་ངོ་མཚར་དུ་གྱུར་རྨད་དུ་བྱུང་བར་གྱུར་དགའ་བར་གྱུར་ཏེ།
en: The Four Maharajas, on hearing these verses from the Bhagavat, were astonished, amazed, and overjoyed.

source: དེ་དག་ཆོས་ཀྱི་ཤུགས་ཀྱིས་ཡུད་ཙམ་ཞིག་ངུས་ནས་མཆི་མ་ཕྱིས་ཏེ།
en: Through the power of the Dharma, they briefly wept and shed tears.

source: དེ་དག་ལུས་འཕར་ཡན་ལག་འདར་ཞིང་དགའ་བ་དང་བདེ་བ་དང་ཡིད་བདེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པར་གྱུར་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དག་གིས་གཏོར་མངོན་པར་གཏོར་ཏོ། །
en: Their bodies shook and their limbs trembled, and they felt joy, bliss, and happiness. They scattered divine coral tree flowers toward the Bhagavat.

source: གཏོར་མངོན་པར་གཏོར་ནས་ཀྱང་སྟན་ལས་ལངས་ཏེ་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་རྒྱལ་པོ་ཆེན་པོ་རེ་རེ་ཡང་གནོད་སྦྱིན་ལྔ་བརྒྱ་ལྔ་བརྒྱ་དང་ཆོས་སྨྲ་བ་དེ་བསྲུང་བ་དང་ཡོངས་སུ་བསྐྱང་བའི་སླད་དུ་རྟག་ཏུ་དགེ་སློང་ཆོས་སྨྲ་བའི་སླད་བཞིན་འབྲང་བར་བགྱིའོ། །
en: When they had scattered them, they rose from their seats, and with their upper robes over one shoulder, knelt on their right knee, and with palms together in homage, bowed toward the Bhagavat and said, “Venerable Bhagavat, we, the Four Mahārājas, each with five hundred yakṣas, will always follow behind the dharmabhāṇaka bhikṣu in order to guard and protect that dharmabhāṇaka.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། རྒྱལ་པོ་ཆེན་པོ་བཞིའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བདུན་པའོ།། །།
en: This concludes “The Four Mahārājas,” the seventh chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་གྱིས་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་བདག་གིས་ཀྱང་དགེ་སློང་ཆོས་སྨྲ་བ་དེའི་ཚིག་བརྒྱན་པའི་སླད་དུ་སྤོབས་པ་ཉེ་བར་བསྒྲུབ་པར་བགྱི།
en: Chapter 8: Sarasvatī Then the great goddess Sarasvatī, with her robe over one shoulder, kneeling with her right knee on the ground and her palms together in homage, bowed toward the Bhagavat and said to the Bhagavat, “Venerable Bhagavat, I, the great goddess Sarasvatī, will bring eloquence to the words of those dharmabhāṇakas so that their words will be beautified.

source: གཟུངས་ཀྱང་སྩལ་བར་བགྱི།
en: I will also bestow on them the power of mental retention.

source: ངེས་པའི་ཚིག་གི་བརྗོད་པ་ཀུན་ཏུ་གཞག་པར་བགྱི།
en: I will establish them in giving definitions.

source: དགེ་སློང་ཆོས་སྨྲ་བ་དེ་ལ་ཡེ་ཤེས་ཀྱི་སྣང་བ་ཆེན་པོ་བགྱིའོ། །
en: I will illuminate those dharmabhāṇakas with the great light of wisdom.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས་ཚིག་གམ་ཡི་གེ་གང་ཡང་རུང་བ་དག་ཅིག་ཡོངས་སུ་ཉམས་པར་གྱུར་ཏམ། བསྐྱུད་ན་བདག་གིས་དགེ་སློང་ཆོས་སྨྲ་བ་དེའི་ངེས་པའི་སྒྲ་དང་ཚིག་དང་ཡི་གེ་དེ་དག་ཐམས་ཅད་བསྒྲུབ་པར་བགྱིའོ། །
en: If any line of verse or syllables of this Lord King of Sūtras, the Sublime Golden Light is left out or forgotten, I will bring all definitions, lines of verse, and syllables to those dharmabhāṇaka bhikṣus.

source: དེ་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བརྒྱ་སྟོང་དག་ལ་དགེ་བའི་རྩ་བ་བསྐྲུན་པའི་སེམས་ཅན་དེ་དག་གི་དོན་གྱི་སླད་དུ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཛམ་བུའི་གླིང་ན་ཡུན་རིང་དུ་གནས་ཤིང་མྱུར་དུ་ནུབ་པར་མི་འགྱུར་བ་དང་། སེམས་ཅན་དུ་མ་དག་གིས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཐོས་ནས་ཤེས་རབ་རྣོ་བ་བསམ་གྱིས་མི་ཁྱབ་པར་འགྱུར་བ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོབ་པར་འགྱུར་བ་དང་། ཚེ་འདི་ལ་ཚེ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་ཐོབ་པར་འགྱུར་བ་དང་། སྲོག་ལ་ཕན་གདགས་པ་དང་། བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མ་མཆིས་པ་རབ་ཏུ་འཛིན་པར་འགྱུར་བ་དང་། ཐབས་སྣ་ཚོགས་རབ་ཏུ་འཚལ་བར་འགྱུར་བ་དང་། བསྟན་བཅོས་ཐམས་ཅད་ལ་མཁས་པར་འགྱུར་བ་དང་། བཟོའི་བགྱི་བ་སྣ་ཚོགས་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་ཐོབ་པར་འགྱུར་བ་དང་། བསྐྱུད་པ་མ་མཆིས་པར་བགྱི་བའི་སླད་དུ་དེ་ལ་གཟུངས་ཀྱང་སྩལ་བར་བགྱིའོ། །དགེ་སློང་ཆོས་སྨྲ་བ་དེ་དང་སེམས་ཅན་ཆོས་ཉན་པ་དེ་དག་གི་དོན་གྱི་སླད་དུ་སྔགས་དང་སྨན་དང་ལྡན་པའི་ཁྲུས་ཀྱི་ལས་བརྗོད་པར་བགྱི་སྟེ། གཟའ་དང་། རྒྱུ་སྐར་དང་། སྐྱེ་བ་དང་། འཆི་བའི་གནོད་པ་དང་། འཐབ་པ་དང་། རྙོག་པ་དང་།
en: “So that this Lord King of Sūtras, the Sublime Golden Light may remain for a long time in Jambudvīpa and not quickly vanish; so that beings can accomplish roots of merit with a hundred thousand buddha bhagavats; so that many beings on hearing this Lord King of Sūtras, the Sublime Golden Light, may develop inconceivably sharp wisdom; so that they may gain an inconceivable aggregation of wisdom; so that they may attain good fortune in this life; so that they may have benefit in life and possess an immeasurable aggregation of merit; so that they may seek a variety of methods; so that they may become learned in all treatises; and so that they may attain perfection in a variety of arts, I will bestow the power of retention so that they will not forget.

source: འཁྲུག་ལོང་དང་། ཁྲག་ཁྲུག་དང་། རྨི་ལམ་ངན་པ་དང་། ལོག་འདྲེན་གྱི་གནོད་པ་ཐམས་ཅད་དང་། བྱད་དང་རོ་ལངས་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར། གང་གིས་མཁས་པ་དག་ཁྲུས་བགྱིད་དུ་སྩལ་བའི་སྨན་དང་སྔགས་ནི་འདི་དག་སྟེ། ཤུ་དག་གིའུ་ཝང་འུ་སུ་དང་། །ཤ་མྱང་ཤ་མི་ཤི་རི་ཤ །དབང་པོའི་ལག་དང་སྐལ་བ་ཆེ། །
en: “I will teach the rite of cleansing with mantras and medicines for the benefit of the dharmabhāṇaka bhikṣus and the beings who listen to the Dharma, so that harm from the planets, lunar asterisms, birth, and death; all the harms from fighting, pollution, riots, chaos, nightmares, and misleaders; and the harms from all evil spirits and vetālas will cease.

source: ཛྙ་མ་ཤིང་ཚ་ཨ་ག་རུ། །ཤི་རི་བེ་སྟ་སྲ་རྩི་དང་། །གུ་གུལ་ར་ས་ཤླ་ལ་ཀི། །རྡོ་དྲེག་ལོ་མ་རྒྱ་སྤོས་དང་། །ཙནྡན་དང་ནི་ལྡོང་རོས་དང་། །གི་ཝང་བཅས་དང་རུ་རྟ་དང་། །གུར་གུམ་གླ་སྒང་ཡུངས་ཀར་དང་། །སྦྱི་མོ་སུག་སྨེལ་ན་ལ་ད། །ནཱ་ག་གེ་སར་ཨུ་ཤི་ར། །འདི་དག་ཆ་ནི་མཉམ་བགྱིས་ནས། །སྐར་མ་རྒྱལ་ལ་བཏགས་པར་བགྱི། །ཕྱེ་མ་ལ་ནི་སྔགས་ཚིག་འདི། །ལན་བརྒྱ་མངོན་པར་གདབ་པར་བགྱི། །ཏད་ཡ་ཐཱ། སུ་ཀྲྀ་ཏེ་ཀྲྀ་ཏ་ཀ་མ་ལ་ནཱི་ལ་ཛི་ན་ཀ་ར་ཏེ། ཧཾ་ཀ་རཱ་ཏེ། ཨིནྡྲ་ཛ་ལི། ཤ་ཀད་དྲེ་བ་ཤད་དྲེ། ཨ་བརྟ་ཀ་སི་ཀེ། ན་ཀུ་ཏྲ་ཀུ། ཀ་བི་ལ་ཀ་བི་ལ་མ་ཏི། ཤཱི་ལ་མ་ཏི།
en: “These are the herbs and medicines through which the wise can cleanse themselves: “Sweet flag, cow bezoar, and fenugreek, Canafistula, acacia, and shami, Orris root and musk, Crepe ginger, cinnamon, and agarwood; “Chir pine rosin and dammar gum, Bdellium and frankincense, Valerian and black stone flower, Sandalwood and realgar; “Bezoar and costus root, Saffron, nut grass, and mustard seed, Linseed, cardamom, and spikenard, And ironwood flowers and vetiver: “Combine equal amounts of each During the Puṣya lunar house.

source: སན་དྷི་དྷུ་དྷུ་མ་མ་བ་ཏི། ཤི་རི་ཤི་རི། ས་ཏྱ་སྠི་ཏེ་སྭཱ་ཧཱ། ལྕི་བས་དཀྱིལ་འཁོར་བགྱིས་ནས་ནི། །མེ་ཏོག་སིལ་མ་དགྲམ་པར་བགྱི། །
en: Recite these mantra words A hundred times over the powder: tadyathā | sukṛte kṛtaka­malanīlajina­karate haṃkarāte indrajali śakaddre vaśaddre avarta­kasike nakutra kukavilakavimalamati śīlamati sandhi­dhudhuma­mavati śiśiri satyasthite svāhā | “Make a circle of cow dung And scatter flower petals.

source: གསེར་གྱི་སྣོད་དང་དངུལ་སྣོད་དུ། །མངར་བའི་ཁུ་བ་གཞག་པར་བགྱི། །
en: Pour sweetened water Into a gold bowl and a silver bowl.

source: སྐྱེས་བུ་གོ་ཆ་བགོས་པ་ནི། །བཞི་ཞིག་དེར་ཡང་གཞག་པར་བགྱི། །རབ་ཏུ་བརྒྱན་པའི་བུ་མོ་བཞི། །བུམ་པ་ཐོགས་པ་གཞག་པར་བགྱི། །རྟག་ཏུ་གུ་གུལ་བདུག་པར་བགྱི། །
en: “You should also place there Four men dressed in armor, And place there four maidens Who are adorned and holding pots.

source: སིལ་སྙན་སྣ་ལྔ་བགྱིད་དུ་སྩལ། །
en: “Perfume the air with bdellium And play the five kinds of musical instruments.

source: གདུགས་དང་རྒྱལ་མཚན་བ་དན་གྱིས། །ལྷ་མོ་དེ་ནི་ལེགས་པར་བརྒྱན། །
en: Adorn the goddess with Banners, parasols, and flags.

source: བར་བར་དག་ཏུ་མེ་ལོང་གཞག །མདའ་དང་མདུང་རྩེ་རྣ་བྲང་གཞག །དེ་ནས་མཚམས་ཀྱང་གཅད་པར་བགྱི། །དེ་ཡི་འོག་ཏུ་དགོས་པ་བརྩམ། །སྔགས་ཀྱི་ལས་ནི་འདི་དག་གིས། །
en: “In between, place mirrors And arrange arrows and spears.

source: མཚམས་བཅད་པ་ཡང་བརྩམ་པར་བགྱི། །སྱད་ཡ་ཐེ་དན། ཨ་ར་ཀེ །ན་ཡ་ནེ། ཧི་ལེ། མི་ལེ། གི་ལེ། ཁི་ཁི་ལེ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་ཀྱི་སྣམ་ལོགས་སུ་ཁྲུས་བགྱིས་ནས་སྔགས་འདི་བཟླས་བརྗོད་བགྱིས་ན་ཁྲུས་ཀྱི་ཞི་བར་སྦྱོར་རོ། །ཏད་ཡ་ཐཱ།
en: Then, after closing the boundary, Commence on what is to be done.

source: ས་ག་ཊེ། བི་ག་ཌེ། བི་ག་ཏ་བ་ཏི་སྭཱ་ཧཱ། ཕྱོགས་བཞི་དག་ན་གང་གནས་པའི། །རྒྱུ་སྐར་དག་གིས་ཚེ་སྲུངས་ཤིག །
en: syād yathedaṃ arake nayane hile mile gile khikhile svāhā | “Engage in the peaceful activity of cleansing by reciting this mantra while washing the body of the Bhagavat: tadyathā | sugaṭe vigaṭe vigatāvati svāhā | “May the lunar asterisms, wherever they are In the four directions, protect lives.

source: བཙས་པའི་སྐར་མའི་གནོད་པ་དང་། །ཕུང་པོའི་ལས་ཀྱི་འཇིགས་འབྱུང་དང་། །འབྱུང་པོའི་ཁམས་རྣམས་འཁྲུག་བགྱིད་པ། །འཇིགས་པ་མི་བཟད་ཞི་གྱུར་ཅིག །ཏདྱ་ཐཱ། ཤ་མེ། བི་ཤ་མེ་སྭཱ་ཧཱ། ས་ག་ཊེ། བི་ག་ཊེ་སྭཱ་ཧཱ། སུ་ཁ་ཏི་ན་ཏེ་སྭཱ་ཧཱ། སཱ་ག་ར་སཾ་བྷཱུ་ཏཱ་ཡ་སྭཱ་ཧཱ། སྐན་དྷ་མ་ཏཱ་ཡ་སྭཱ་ཧཱ། ནཱི་ལ་ཀཎྛཱ་ཡ་སྭཱ་ཧཱ། ཨ་པ་ར་ཛི་ཏ་བཱིརྱཱ་ཡ་སྭཱ་ཧཱ། ཧི་མ་བ་ཏ་སཾ་བྷཱུ་ཏཱ་ཡ་སྭཱ་ཧཱ། ཨ་ནི་མི་ལ་བཀ་ཏྲཱ་ཡ་སྭཱ་ཧཱ།
en: May they bring to an end the dreadful terrors Of the harms from the stars of one’s birth, The fears that arise from a multitude of actions, And the disturbances of the elements.

source: ན་མོ་བྷ་ག་བ་ཏེ། བྲཧྨ་ཎེ། ན་མཿས་ར་སྭ་ཏྱཻ་དེ་བྱཻ་སིདྷྱཾ་ཏུ་མནྟྲ་པ་ད། དཾ་བྲཧྨ་ཨ་ནུ་མ་ནྱ་ཏུ་སྭཱ་ཧཱ། དགེ་སློང་ཆོས་སྨྲ་བ་དེ་བསྲུང་བ་དང་ཆོས་མཉན་པ་དེ་དག་དང་། ཡི་གེར་འདྲི་བ་དེ་དག་གི་དོན་གྱི་སླད་དུ་ཁྲུས་ཀྱི་ལས་འདིས་བདག་ཉིད་དེར་མཆི་བར་བགྱིའོ། །
en: tadyathā | śame viṣame svāhā | sagaṭe vigaṭe svāhā | sukhatinate svāhā | sāgara­saṃbhūtāya svāhā | skandhamatāya svāhā | nīlakaṇṭhāya svāhā | aparājita­vīryāya svāhā | himavat­saṃbhūtāya svāhā | animilavaktrāya svāhā | namo bhagavate brāhmaṇe | namaḥ sarasvatyai devyai | sidhyantu mantrapadā daṃ brahma anumanyatu svāhā | “I will be there, because of this washing ritual, in order to guard the dharmabhāṇaka bhikṣu and those who listen to the Dharma and those who write it out.
